In [109]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [110]:
df=pd.read_csv("employee_data.csv")
df.head()

    Name    Age      Salary Department  Experience
0   Amit   31.0     -5699.0    Finance         NaN
1  Arjun    NaN  10000000.0    Finance         NaN
2   Neha    NaN  10000000.0         HR         3.0
3   John  200.0  10000000.0         HR        14.0
4  Priya   37.0         NaN         HR         NaN

In [111]:
print("---Misisng values ---")
df.isnull().sum()

---Misisng values ---

Name           0
Age           65
Salary        40
Department     0
Experience    95
dtype: int64

In [112]:
df.rename(columns={'Experience':'Exp'},inplace=True)

In [113]:
print("---Filled Missing values---")
# it  will fill the blank age cells with median of the others cells in real file
# df['Age'].fillna(df['Age'].median(), inplace=True)
df['Age'] = df['Age'].fillna(df['Age'].median())

#it  will fill the blank Salary cells with mean of the others cells in real file
df['Salary'] = df['Salary'].fillna(df['Salary'].median())


df['Exp']=df['Exp'].fillna(df['Exp'].median())

#inf and -inf-> nan
df.replace([np.inf,-np.inf],np.nan,inplace=True)


"""Removing Duplicate values"""
df.drop_duplicates(inplace=True)

"""Replace neg value with avg 
                     (---condition---,-----code ------- ,column)"""
df['Salary']=np.where(df['Salary']<0,df['Salary'].mean(),df['Salary'])

#IQR method
Q1 = df['Salary'].quantile(0.25)
Q3 = df['Salary'].quantile(0.75)

IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR


""" Revoming the rows whose salary are too high too low """
df = df[(df['Salary'] >= lower_bound) & (df['Salary'] <= upper_bound)]


df.to_csv('cleaned_dataset.csv')
print("Dateset cleaned")

---Filled Missing values---
Dateset cleaned

In [114]:
df=pd.read_csv("cleaned_dataset.csv")
df

     Unnamed: 0   Name    Age        Salary Department   Exp
0             0   Amit   31.0  2.763688e+06    Finance   9.0
1             1  Arjun   55.0  1.000000e+07    Finance   9.0
2             2   Neha   55.0  1.000000e+07         HR   3.0
3             3   John  200.0  1.000000e+07         HR  14.0
4             4  Priya   37.0  8.476200e+04         HR   9.0
..          ...    ...    ...           ...        ...   ...
127         155   John   36.0  8.476200e+04    Support   9.0
128         156    Tom  200.0  2.763688e+06    Support  18.0
129         157   Neha   60.0  8.476200e+04      Sales   9.0
130         158   Amit   55.0  8.359200e+04      Admin  19.0
131         159    Tom   55.0  1.000000e+07    Support  12.0

[132 rows x 6 columns]